#+TITLE: GNU Emacs Config
#+AUTHOR: Yeonho Jang
#+DESCRIPTION: My Personal Emacs setting
#+STARTUP: showeverything
#+OPTIONS: toc:2

** Git (Magit)

#+BEGIN_SRC emacs-lisp
  ;;(use-package magit-section 
  ;;  :ensure t)
  (use-package cond-let
    :ensure t)

  (use-package transient
    :ensure t)

  (use-package magit
    :ensure t
    :after (cond-let transient)
    :commands (magit-status)
    :bind (("C-x g" . magit-status))
    :config
    (setf (alist-get 'unpushed magit-section-initial-visibility-alist) 'show))



#+END_SRC

#+RESULTS:
: [nil 26768 3830 347673 nil elpaca-process-queues nil nil 0 nil]

